swimmerCFDcode-in progress/ForceVsOuterBoundarySize/OpenFoamFiles/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
=========                 |
\\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
\\    /   O peration     | Website:  https://openfoam.org
\\  /    A nd           | Version:  9
\\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
format      ascii;
class       dictionary;
location    "system";
object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

endTime         0.11249999999999999;

deltaT          1e-3;
writeControl    runTime;
writeInterval   0.0001;

////- For testing with moveDynamicMesh
//deltaT          0.01;
//writeControl    timeStep;
//writeInterval   10;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo 25;

functions
{
#includeFunc Q
#include "surfaces"
#include "forces"
}

// ************************************************************************* //
